Tekla Open API Reference for Tekla Structures 2025
ModelHistory.GetDeletedObjectsWithType Method
Note: This API is now obsolete.
 Gets based on type a list of the objects that have been deleted after the modification stamp.
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Use TakeModifications() instead.")]
public static ModelObjectEnumerator GetDeletedObjectsWithType(
	ModificationStamp ModStamp,
	ModelObject.ModelObjectEnum Enum
)
<ObsoleteAttribute("Use TakeModifications() instead.")>
Public Shared Function GetDeletedObjectsWithType (
	ModStamp As ModificationStamp,
	Enum As ModelObject.ModelObjectEnum
) As ModelObjectEnumerator
Parameters
ModStamp
Type: Tekla.Structures.Model.History.ModificationStamp
The modification stamp.
Enum
Type: Tekla.Structures.Model.ModelObject.ModelObjectEnum
The type of the objects to return.
Return Value
Type: ModelObjectEnumerator
A list of the objects that have been deleted after the given modification stamp.
See Also
Reference
ModelHistory Class
Tekla.Structures.Model.History Namespace